###############################################################################
# Created by write_sdc
# Sat Apr 18 16:48:01 2026
###############################################################################
current_design router_1x3
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 
set_clock_uncertainty 0.2500 clk
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clock}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_in[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pkt_valid}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_enb_0}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_enb_1}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {read_enb_2}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {resetn}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {busy}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_0[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_0[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_0[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_0[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_0[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_0[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_0[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_0[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_1[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_1[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_1[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_1[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_1[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_1[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_1[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_1[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_2[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_2[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_2[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_2[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_2[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_2[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_2[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {data_out_2[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {error}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {valid_out_0}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {valid_out_1}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {valid_out_2}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {busy}]
set_load -pin_load 0.0334 [get_ports {error}]
set_load -pin_load 0.0334 [get_ports {valid_out_0}]
set_load -pin_load 0.0334 [get_ports {valid_out_1}]
set_load -pin_load 0.0334 [get_ports {valid_out_2}]
set_load -pin_load 0.0334 [get_ports {data_out_0[7]}]
set_load -pin_load 0.0334 [get_ports {data_out_0[6]}]
set_load -pin_load 0.0334 [get_ports {data_out_0[5]}]
set_load -pin_load 0.0334 [get_ports {data_out_0[4]}]
set_load -pin_load 0.0334 [get_ports {data_out_0[3]}]
set_load -pin_load 0.0334 [get_ports {data_out_0[2]}]
set_load -pin_load 0.0334 [get_ports {data_out_0[1]}]
set_load -pin_load 0.0334 [get_ports {data_out_0[0]}]
set_load -pin_load 0.0334 [get_ports {data_out_1[7]}]
set_load -pin_load 0.0334 [get_ports {data_out_1[6]}]
set_load -pin_load 0.0334 [get_ports {data_out_1[5]}]
set_load -pin_load 0.0334 [get_ports {data_out_1[4]}]
set_load -pin_load 0.0334 [get_ports {data_out_1[3]}]
set_load -pin_load 0.0334 [get_ports {data_out_1[2]}]
set_load -pin_load 0.0334 [get_ports {data_out_1[1]}]
set_load -pin_load 0.0334 [get_ports {data_out_1[0]}]
set_load -pin_load 0.0334 [get_ports {data_out_2[7]}]
set_load -pin_load 0.0334 [get_ports {data_out_2[6]}]
set_load -pin_load 0.0334 [get_ports {data_out_2[5]}]
set_load -pin_load 0.0334 [get_ports {data_out_2[4]}]
set_load -pin_load 0.0334 [get_ports {data_out_2[3]}]
set_load -pin_load 0.0334 [get_ports {data_out_2[2]}]
set_load -pin_load 0.0334 [get_ports {data_out_2[1]}]
set_load -pin_load 0.0334 [get_ports {data_out_2[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clock}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pkt_valid}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_enb_0}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_enb_1}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {read_enb_2}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {resetn}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {data_in[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
